# Brewfile — declarative list of everything Homebrew installs.
# Apply it with: brew bundle --file=Brewfile
# Add or remove packages here; never edit the install scripts for this.

# Taps (third-party formula repositories)
tap "hashicorp/tap"

# Command-line tools
brew "apfel"   # Apple Intelligence CLI + OpenAI-compatible API server
brew "git"
brew "gh"        # GitHub CLI
brew "glab"      # GitLab CLI
brew "nvm"       # Node version manager
brew "pyenv"     # Python version manager
brew "awscli"    # AWS command-line interface
brew "azure-cli" # Azure command-line interface
brew "hashicorp/tap/terraform" # infrastructure as code (official HashiCorp tap)
brew "jq"        # JSON processor
brew "ripgrep"   # fast recursive search
brew "watch"     # run a command periodically
brew "tmux"      # terminal multiplexer (Claude Code teammate panes)

# Applications (casks)
cask "1password"
cask "1password-cli" # `op` — 1Password from the command line
cask "chatgpt-atlas"
cask "claude"
cask "claude-code"
cask "clipy"
cask "codex"
cask "codex-app"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "microsoft-office"
cask "microsoft-teams"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "zed"
cask "zoom"
