# Brewfile — declarative list of everything Homebrew installs.
# Apply it with: brew bundle --file=Brewfile
# Add or remove packages here; never edit the install scripts for this.
# Keep each section in alphabetical order (formulae by tool name).

# Taps (third-party formula repositories)
tap "atlassian/acli"
tap "hashicorp/tap"

# Command-line tools
brew "atlassian/acli/acli"     # Atlassian CLI (Jira and Confluence, official tap)
brew "apfel"                   # Apple Intelligence CLI + OpenAI-compatible API server
brew "awscli"                  # AWS command-line interface
brew "azure-cli"               # Azure command-line interface
brew "gh"                      # GitHub CLI
brew "git"
brew "glab"                    # GitLab CLI
brew "jq"                      # JSON processor
brew "nvm"                     # Node version manager
brew "pyenv"                   # Python version manager
brew "ripgrep"                 # fast recursive search
brew "hashicorp/tap/terraform" # infrastructure as code (official HashiCorp tap)
brew "tmux"                    # terminal multiplexer (Claude Code teammate panes)
brew "watch"                   # run a command periodically

# Applications (casks)
cask "1password"          # password manager and secure vault
cask "1password-cli"      # `op` — 1Password from the command line
cask "chatgpt-atlas"      # OpenAI's ChatGPT desktop browser
cask "claude"             # Anthropic's Claude desktop app
cask "claude-code"        # Anthropic's agentic coding tool for the terminal
cask "clipy"              # clipboard-history manager
cask "codex"              # OpenAI's command-line coding agent
cask "codex-app"          # OpenAI's Codex desktop app
cask "cursor"             # AI-first code editor (a Visual Studio Code fork)
cask "dbeaver-community"  # DBeaver Community Edition — universal database client
cask "discord"            # voice, video and text chat for communities
cask "docker-desktop"     # builds, runs and manages Docker containers locally
cask "dropbox"            # cloud file storage and sync
cask "firefox"            # web browser
cask "google-chrome"      # web browser
cask "iterm2"             # feature-rich terminal emulator for macOS
cask "microsoft-office"   # Word, Excel, PowerPoint, Outlook and OneNote
cask "microsoft-teams"    # team chat, calls and meetings
cask "mitmproxy"          # interactive HTTPS proxy CLI (`mitmproxy`, `mitmweb`, `mitmdump`)
cask "postman"            # API client for building and testing HTTP requests
cask "rectangle"          # window manager; snap and resize with keyboard shortcuts
cask "slack"              # team messaging
cask "spotify"            # music streaming
cask "visual-studio-code" # extensible code editor
cask "whatsapp"           # messaging desktop app
cask "zed"                # high-performance, collaborative code editor
cask "zoom"               # video conferencing
